{
  "backend/main.mo": "Motoko canister managing profiles, access control, and audio submissions with admin checks and user-specific queries.",
  "feature_evidence.json": "Feature evidence report linking features to files, components, and test requirements for deployment verification.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files used for reference in build planning.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Detailed deployment verification checklist covering provider hierarchy, UI changes, and post-deploy tests.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color tokens and light/dark mode variables.",
  "frontend/index.html": "Base HTML entry point loading the React application via main.tsx.",
  "frontend/scripts/redeploy-testing-build.sh": "Shell script that rebuilds and redeploys the frontend canister with retry logic.",
  "frontend/src/App.tsx": "Wraps the router in AuthProvider to provide global auth context.",
  "frontend/src/components/AdminPanel.tsx": "Admin UI for reviewing audio submissions, approving/rejecting them, and viewing artist profiles.",
  "frontend/src/components/AppShell.tsx": "Empty placeholder file.",
  "frontend/src/components/AuthHydrationGuard.tsx": "Empty placeholder file.",
  "frontend/src/components/CreatorZoneAuthControls.tsx": "Renders a logout button for authenticated users, otherwise nothing.",
  "frontend/src/components/CreatorZoneFallback.tsx": "Empty placeholder file.",
  "frontend/src/components/CreatorZoneTab.tsx": "Form UI for submitting audio metadata with duration, premium flag, and idle logout alerts.",
  "frontend/src/components/Dashboard.tsx": "Empty component placeholder.",
  "frontend/src/components/Footer.tsx": "Renders app footer with branding, year, and caffeine.ai link.",
  "frontend/src/components/FullScreenLoading.tsx": "Full‑screen loading screen with spinner and optional message.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling login state, user profile, role-based studio link, and identity transitions.",
  "frontend/src/components/HydrationTimeoutBanner.tsx": "Empty component placeholder.",
  "frontend/src/components/ProfileSetup.tsx": "Empty component placeholder.",
  "frontend/src/components/RouteAccessGuard.tsx": "Guards routes based on authentication and admin role, redirecting or blocking until resolved.",
  "frontend/src/components/SafeRoot.tsx": "Empty component placeholder.",
  "frontend/src/components/StudioTab.tsx": "Empty component placeholder.",
  "frontend/src/components/TestingModeBanner.tsx": "Displays fixed banner indicating the app is in testing mode.",
  "frontend/src/contexts/AuthContext.tsx": "Manages auth state using Internet Identity, idle auto‑logout, and navigation on logout.",
  "frontend/src/contexts/HydrationHardExitContext.tsx": "Empty context placeholder.",
  "frontend/src/hooks/useActor.ts": "Creates backend actor tied to identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, roles, and admin status via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/Home.tsx": "Renders the home page with a welcome header and creator zone section.",
  "frontend/src/pages/Studio.tsx": "Loads the caller’s profile and displays the admin studio panel with a loading state.",
  "frontend/src/router.ts": "Creates and exports the application router based on the route tree.",
  "frontend/src/routeTree.tsx": "Defines the root layout and routes for Home and Studio using TanStack Router.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and persisting URL parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and container settings.",
  "project_state.json": "Describes the project state, features, and deployment requirements for the VAANI app."
}