{
  "backend/main.mo": "Motoko canister managing user profiles, audio submission metadata, and access-controlled queries and mutations for users and admins.",
  "feature_evidence.json": "Feature evidence report listing required AuthContext routing, login, and UX behaviors tied to specific frontend files.",
  "frontend-file-summaries.txt": "Reference file containing pre-written summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML document bootstrapping the app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Top-level app component wrapping Creator Zone content in AuthProvider.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for reviewing, approving, and rejecting audio submissions and viewing artists.",
  "frontend/src/components/AppShell.tsx": "Empty placeholder file.",
  "frontend/src/components/AuthHydrationGuard.tsx": "Empty placeholder file.",
  "frontend/src/components/CreatorZoneAuthControls.tsx": "Login/logout control buttons that reflect authentication and login-in-progress state.",
  "frontend/src/components/CreatorZoneFallback.tsx": "Empty placeholder file.",
  "frontend/src/components/CreatorZoneTab.tsx": "Creator-facing form for submitting audio metadata with inline idle-logout alert behavior.",
  "frontend/src/components/Dashboard.tsx": "Empty placeholder file.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright text and links to caffeine.ai using icons.",
  "frontend/src/components/FullScreenLoading.tsx": "Displays a centered full‑screen loading spinner with an optional message.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication handling, admin checks, and dynamic query resets on identity changes.",
  "frontend/src/components/HydrationTimeoutBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/SafeRoot.tsx": "Empty placeholder component file.",
  "frontend/src/components/StudioTab.tsx": "Empty placeholder component file.",
  "frontend/src/contexts/AuthContext.tsx": "Provides auth state, idle timeout auto‑logout, login/logout helpers, and admin redirect after login.",
  "frontend/src/contexts/HydrationHardExitContext.tsx": "Empty placeholder context file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth client loading, login, logout, and exposes identity and login state via context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React‑Query hooks wrapping backend calls for profiles, roles, admin checks, and audio submissions.",
  "frontend/src/index.css": "Tailwind setup and CSS variables defining light/dark theme color tokens and global styles.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/Studio.tsx": "Admin-only Studio page that checks identity and role, redirects unauthorized users, and renders the admin panel with loading states.",
  "frontend/src/router.ts": "Creates and registers the TanStack Router instance using the route tree.",
  "frontend/src/routeTree.tsx": "Defines the root, index, and /studio routes using TanStack Router with shared layout components.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and plugins.",
  "project_state.json": "Project metadata describing current version, architectural rules, admin access constraints, and known UI issues."
}