{
  "backend/main.mo": "Motoko actor managing user profiles, access control, and audio submission workflows with permission checks and metadata storage.",
  "feature_evidence.json": "Feature evidence report describing a routing update tied to TanStack Router and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference or build planning.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Home page that welcomes users and renders the Creator Zone submission tab.",
  "frontend/src/components/AdminPanel.tsx": "Admin dashboard with tabs for pending submissions, approved audio, and user profiles, including approval and rejection logic.",
  "frontend/src/components/AppShell.tsx": "Empty placeholder component file.",
  "frontend/src/components/AuthHydrationGuard.tsx": "Empty placeholder component file.",
  "frontend/src/components/CreatorZoneFallback.tsx": "Empty placeholder component file.",
  "frontend/src/components/CreatorZoneTab.tsx": "Creator form allowing users to submit audio metadata for admin approval.",
  "frontend/src/components/Dashboard.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright and caffeine.ai attribution.",
  "frontend/src/components/FullScreenLoading.tsx": "Full-screen loading indicator with animated spinner and optional message.",
  "frontend/src/components/Header.tsx": "Header component managing navigation, authentication state, and identity-driven cache resets. Conditionally shows admin Studio link based on user profile and login state.",
  "frontend/src/components/HydrationTimeoutBanner.tsx": "Empty file placeholder for a hydration timeout UI component.",
  "frontend/src/components/ProfileSetup.tsx": "Empty file placeholder for a user profile setup component.",
  "frontend/src/components/SafeRoot.tsx": "Empty file placeholder intended for an app root wrapper with safety or fallback logic.",
  "frontend/src/components/StudioTab.tsx": "Empty file placeholder for a Studio tab component.",
  "frontend/src/contexts/HydrationHardExitContext.tsx": "Empty context placeholder likely meant for managing hydration-related exit behavior.",
  "frontend/src/hooks/useActor.ts": "Hook that creates an authenticated or anonymous backend actor and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context managing Internet Identity login, stored identity loading, and login state tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating profiles, roles, admin checks, artist lists, and audio submissions.",
  "frontend/src/index.css": "Tailwind CSS setup defining global theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and CSS.",
  "frontend/src/pages/Studio.tsx": "Admin-only page that loads the caller’s profile, redirects non-admins, and renders the admin panel.",
  "frontend/src/router.ts": "Router instance creation and type registration for TanStack Router.",
  "frontend/src/routeTree.tsx": "Router configuration defining root layout and routes for home and Studio pages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session-based values.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, plugin integrations, custom colors, animations, fonts, and container settings. Extends theme with OKLCH-based design tokens and accordion keyframes.",
  "project_state.json": "Project state describing the VAANI MVP backend/UI architecture, admin-only Studio workflow, and root UI simplification. Notes include admin rules, routing constraints, and known UI/auth regressions to fix."
}