{
  "backend/main.mo": "Main backend actor providing user profiles, audio submission metadata, and access‑controlled queries and mutations using AccessControl and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping UI refinement features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to brief functional descriptions for documentation or build planning.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Deployment verification checklist detailing visual, functional, and QA checks for the premium header and landing page update.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for themes, dark mode tokens, and global background/text styles.",
  "frontend/index.html": "Basic HTML entry point containing the root div and script loader for the frontend app.",
  "frontend/scripts/redeploy-testing-build.sh": "Shell script to redeploy the frontend canister with retry logic, environment checks, and post‑deployment instructions.",
  "frontend/src/App.tsx": "Root React component wrapping the router in AuthProvider to provide authentication context across all routes.",
  "frontend/src/components/AdminPanel.tsx": "Admin UI listing pending submissions, approved audio, and user profiles with approve/reject actions.",
  "frontend/src/components/AppShell.tsx": "Empty placeholder component file.",
  "frontend/src/components/AuthHydrationGuard.tsx": "Empty placeholder component file.",
  "frontend/src/components/CreatorZoneAuthControls.tsx": "Shows a logout button for authenticated creators; hidden otherwise.",
  "frontend/src/components/CreatorZoneFallback.tsx": "Empty placeholder component file.",
  "frontend/src/components/CreatorZoneTab.tsx": "Form for creators to submit audio metadata for admin approval, including idle logout notice handling.",
  "frontend/src/components/Dashboard.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Renders site footer with credits and link to caffeine.ai.",
  "frontend/src/components/FullScreenLoading.tsx": "Full‑screen loading spinner with optional message.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling login state, profile retrieval, admin studio access, and user menu.",
  "frontend/src/components/HydrationTimeoutBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/RouteAccessGuard.tsx": "Route guard enforcing admin vs non‑admin access and blocking rendering until role resolution.",
  "frontend/src/components/SafeRoot.tsx": "Empty placeholder component file.",
  "frontend/src/components/StudioTab.tsx": "Empty placeholder component file.",
  "frontend/src/components/TestingModeBanner.tsx": "Displays a fixed banner indicating the app is in testing mode.",
  "frontend/src/contexts/AuthContext.tsx": "Authentication context managing identity state, idle logout, and login/logout flows.",
  "frontend/src/contexts/HydrationHardExitContext.tsx": "Empty placeholder context file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, admin state, and artist data via an actor API.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light and dark themes and global typography settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/Home.tsx": "A simple homepage displaying a welcome message and the CreatorZoneTab component.",
  "frontend/src/pages/Studio.tsx": "Admin studio page that loads the user profile and renders the AdminPanel once ready.",
  "frontend/src/router.ts": "Creates and exports the TanStack Router instance using the defined route tree.",
  "frontend/src/routeTree.tsx": "Defines the application’s root, home, and studio routes with layout wrappers and access guard.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, container settings, and plugin usage.",
  "project_state.json": "Holds the current VAANI Studio project state, including UI‑polish goals, existing features, new feature requests, and design direction notes."
}