{
  "backend/main.mo": "Motoko canister managing user profiles, artist search, and audio submission/approval with AccessControl enforcement.",
  "feature_evidence.json": "Feature evidence report linking a deployment verification task to related files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of multiple frontend files.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Checklist for verifying correct AuthProvider placement after deploying the frontend.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark OKLCH color tokens.",
  "frontend/index.html": "Static HTML shell mounting the React app at the root div.",
  "frontend/src/App.tsx": "Home page layout rendering Creator Zone content with a welcome header.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface displaying pending audio submissions, approved audio, and user profiles with approve/reject actions.",
  "frontend/src/components/AppShell.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/AuthHydrationGuard.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/CreatorZoneAuthControls.tsx": "Auth control buttons for Creator Zone, showing login, logout, or loading state.",
  "frontend/src/components/CreatorZoneFallback.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/CreatorZoneTab.tsx": "Creator Zone form for submitting audio metadata, including auth controls and idle-logout alert.",
  "frontend/src/components/Dashboard.tsx": "Empty placeholder file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding and external link using icons.",
  "frontend/src/components/FullScreenLoading.tsx": "Displays a centered full‑screen loading spinner with an optional message.",
  "frontend/src/components/Header.tsx": "Provides the main app header with navigation, auth state handling, and admin‑aware UI logic.",
  "frontend/src/components/HydrationTimeoutBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetup.tsx": "Empty placeholder component file.",
  "frontend/src/components/SafeRoot.tsx": "Empty placeholder component file.",
  "frontend/src/components/StudioTab.tsx": "Empty placeholder component file.",
  "frontend/src/contexts/AuthContext.tsx": "Implements global auth management, idle logout, and navigation logic linked to Internet Identity.",
  "frontend/src/contexts/HydrationHardExitContext.tsx": "Empty placeholder context file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, state management, and auto‑loading of stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, admin status, artists, and audio submissions.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark mode.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Studio.tsx": "Studio admin page that checks auth and admin status before rendering the admin panel.",
  "frontend/src/router.ts": "Creates and exports the TanStack router instance wired to the route tree with type registration.",
  "frontend/src/routeTree.tsx": "Defines the root layout with header/footer and sets up routes for '/' and '/studio' using TanStack Router.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend build.",
  "project_state.json": "Stores project metadata, constraints, architecture notes, and known issues for the VAANI application."
}