{
  "backend/main.mo": "Actor manages user profiles and audio submissions with access control, offering queries and updates for profiles, artists, and audio metadata.",
  "feature_evidence.json": "Feature evidence report mapping high‑level auth refactor requirements to source files and components with confidence and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and purpose of various frontend source files after the auth‑provider refactor.",
  "frontend/DEPLOYMENT_VERIFICATION.md": "Deployment checklist verifying provider hierarchy, source‑only changes, and end‑to‑end auth and navigation behavior post‑refactor.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and dark‑mode overrides for the app theme.",
  "frontend/index.html": "HTML entry file rendering the root div and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Home page component rendering welcome text and the CreatorZoneTab.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface showing pending submissions, approved audio, and users with actions for approval and rejection.",
  "frontend/src/components/AppShell.tsx": "Empty placeholder component file.",
  "frontend/src/components/AuthHydrationGuard.tsx": "Empty placeholder component file.",
  "frontend/src/components/CreatorZoneAuthControls.tsx": "Login/logout button component driven by AuthContext state.",
  "frontend/src/components/CreatorZoneFallback.tsx": "Empty placeholder component file.",
  "frontend/src/components/CreatorZoneTab.tsx": "Form UI for submitting audio metadata for admin approval with idle-logout notice handling.",
  "frontend/src/components/Dashboard.tsx": "Empty component placeholder.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding and a link to caffeine.ai.",
  "frontend/src/components/FullScreenLoading.tsx": "Full‑screen loading indicator component with optional message.",
  "frontend/src/components/Header.tsx": "App header providing navigation, user menu, admin routing logic, and identity-driven state handling.",
  "frontend/src/components/HydrationTimeoutBanner.tsx": "Empty component placeholder.",
  "frontend/src/components/ProfileSetup.tsx": "Empty component placeholder.",
  "frontend/src/components/SafeRoot.tsx": "Empty component placeholder.",
  "frontend/src/components/StudioTab.tsx": "Empty component placeholder.",
  "frontend/src/contexts/AuthContext.tsx": "Auth context managing Internet Identity login/logout, admin redirects, and idle auto‑logout.",
  "frontend/src/contexts/HydrationHardExitContext.tsx": "Empty context placeholder.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing AuthClient lifecycle, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, roles, admin checks, artist lists, and audio submission actions.",
  "frontend/src/index.css": "Defines Tailwind layers and theme CSS variables for light/dark modes and applies base background and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/pages/Studio.tsx": "Admin-only Studio page that checks authentication and role before rendering the admin panel, showing loaders during redirects or profile fetches.",
  "frontend/src/router.ts": "Creates and exports the TanStack Router instance and registers its type.",
  "frontend/src/routeTree.tsx": "Defines the root layout and routes for the app, including the index and /studio routes using TanStack Router.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, animations, and plugins with custom CSS variable-driven theming.",
  "project_state.json": "Project state metadata detailing auth provider issues, required fixes, and feature requests for adjusting provider hierarchy."
}