{
  "kind": "build_request",
  "title": "Fix logout blank-screen via root soft-redirect and add admin-only post-login redirect to /studio",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-61",
      "text": "Update the AuthContext logout redirect behavior so that after any logout (manual logout or idle auto-logout) the app clears session state and then performs a soft redirect to the Creator Zone root route using `navigate('/', { replace: true })` (route must be `/`, and `/creator-zone` must not be used).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "After logout:\n→ Clear session\n→ navigate('/', { replace: true })"
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks Log out, the app clears Internet Identity session state and React Query cache, then navigates to `/` with `{ replace: true }` (no hard reload).",
        "When the user is auto-logged-out due to idleness, the app clears session state and React Query cache, then navigates to `/` with `{ replace: true }` (no hard reload).",
        "The codebase does not navigate to `/creator-zone` anywhere as part of this logout flow."
      ]
    },
    {
      "id": "REQ-62",
      "text": "Implement role-based post-login navigation strictly in the login success path: after a successful Internet Identity login initiated by the app’s Login action, if the authenticated user is confirmed admin, perform `navigate('/studio', { replace: true })`; if the user is non-admin, perform no navigation (remain on the current page, which is `/`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "After login:\n• If admin → navigate('/studio', { replace: true })\n• If non-admin → no navigation (remain on current page /)",
          "Use replace: true and apply this only in the login success handler."
        ]
      },
      "acceptanceCriteria": [
        "If login succeeds and the user is admin, the app navigates to `/studio` using `{ replace: true }`.",
        "If login succeeds and the user is not admin, the app does not call `navigate()` as part of the login success handling.",
        "The admin redirect occurs only as a consequence of a successful login action (i.e., it does not trigger on normal page load/rehydration when an identity is already present)."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Keep routing and existing guards unchanged while applying these UX fixes: do not introduce any new routes, do not change the routing structure, and do not modify root layout, Header, router setup, Studio guards, or any compiled/built bundle files as part of this change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Do not introduce new routes.\nDo not change routing structure.",
          "❌ Do not modify root, header, router, auth guards, or compiled files."
        ]
      },
      "acceptanceCriteria": [
        "Only the scoped redirect logic is changed; no new routes are added (still only `/` and `/studio`).",
        "No changes are made to routeTree route definitions/paths or router instantiation.",
        "No compiled/bundled output files are edited."
      ]
    }
  ],
  "constraints": [
    "Creator Zone route is `/` (root).",
    "`/creator-zone` does not exist and must not be introduced or used.",
    "Do not introduce new routes.",
    "Do not change routing structure.",
    "Do not modify root, Header, router setup, or Studio auth guard logic.",
    "Do not edit any compiled/built files; source-only changes.",
    "User-facing text (if any is added/changed) must be in English."
  ],
  "nonGoals": [
    "Adding or changing any authentication UI flows beyond the specified redirects.",
    "Changing backend logic, roles, or admin determination rules.",
    "Refactoring unrelated components or adding new navigation tabs/pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}