{
  "kind": "build_request",
  "title": "Publish (redeploy) VAANI testing build",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Redeploy the existing VAANI project (do not initialize a new project) to produce a publicly accessible testing build, retrying deployment if the previous attempt errored.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "bro lets publish this project vaani for testing"
        ]
      },
      "acceptanceCriteria": [
        "A new deployment is completed for the existing VAANI project (not a new canister/app).",
        "If a deployment error occurs, the deployment is retried and completes successfully.",
        "The deployed app is reachable in a browser as a testing build."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After redeploying, verify the live testing build against the checklist in `frontend/DEPLOYMENT_VERIFICATION.md` (initial unauthenticated load, login flow, authenticated navigation, logout flow, idle timeout, logo verification, and console verification).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "bro lets publish this project vaani for testing"
        ]
      },
      "acceptanceCriteria": [
        "All checklist items in `frontend/DEPLOYMENT_VERIFICATION.md` can be confirmed in the live environment.",
        "No provider-related console errors occur (e.g., \"useAuth must be used within AuthProvider\" / \"useInternetIdentity must be used within InternetIdentityProvider\").",
        "No broken image/asset 404 errors occur for the header logo asset."
      ]
    }
  ],
  "constraints": [
    "Do not initialize a new project; redeploy the existing VAANI web app using the current draft.",
    "Deployment scope is limited to the existing UI-only changes already described for VAANI (no new features).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new backend features or changing backend data schema.",
    "Introducing new authentication providers (only Internet Identity is supported).",
    "Adding new pages or routes beyond what already exists for VAANI."
  ],
  "imageRequirements": {
    "required": [
      "VAANI header wordmark/logo in SVG (vaani-logo-header.dim_240x64.svg)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}