{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix logout soft-redirect to root and add admin-only post-login redirect to Studio",
  "requirements": [
    {
      "id": "REQ-61",
      "summary": "Ensure all logout paths clear session + React Query cache, then soft-redirect to `/` with history replace (never `/creator-zone`).",
      "acceptanceCriteria": [
        "When the user clicks Log out, the app clears Internet Identity session state and React Query cache, then navigates to `/` with `{ replace: true }` (no hard reload).",
        "When the user is auto-logged-out due to idleness, the app clears session state and React Query cache, then navigates to `/` with `{ replace: true }` (no hard reload).",
        "The codebase does not navigate to `/creator-zone` anywhere as part of this logout flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/AuthContext.tsx",
          "operation": "modify",
          "description": "Update manual logout and idle auto-logout flows to (1) clear Internet Identity session state, (2) clear React Query cache, and then perform a soft redirect to the Creator Zone root route `/` using navigation with `replace: true` (no hard reload). Ensure this redirect logic never targets `/creator-zone`. Use the existing authorization component’s guidance to clear all cached application data on logout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Add role-based post-login navigation only in the app-initiated login success path: admin → `/studio` replace; non-admin → no navigation.",
      "acceptanceCriteria": [
        "If login succeeds and the user is admin, the app navigates to `/studio` using `{ replace: true }`.",
        "If login succeeds and the user is not admin, the app does not call `navigate()` as part of the login success handling.",
        "The admin redirect occurs only as a consequence of a successful login action (i.e., it does not trigger on normal page load/rehydration when an identity is already present)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/AuthContext.tsx",
          "operation": "modify",
          "description": "Implement an app-initiated-login flag and a login-success handler that runs only after the user clicks the app’s Login action and Internet Identity login succeeds. In that success handler, confirm admin status (e.g., via existing role/admin query hooks backed by the authorization system) and only then soft-navigate to `/studio` with `replace: true`; if non-admin, do not navigate. Ensure this logic does not run on identity rehydration/initialization. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Apply the redirect UX fixes without changing routing structure, guards, root layout, Header, router setup, or compiled outputs.",
      "acceptanceCriteria": [
        "Only the scoped redirect logic is changed; no new routes are added (still only `/` and `/studio`).",
        "No changes are made to routeTree route definitions/paths or router instantiation.",
        "No compiled/bundled output files are edited."
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/AuthContext.tsx",
          "operation": "modify",
          "description": "Keep all changes scoped to AuthContext redirect behavior only (logout redirect + post-login admin redirect) and avoid touching routeTree, router instantiation, root layout, Header, Studio guards, or any compiled/bundled outputs; verify navigation targets remain limited to existing routes `/` and `/studio`."
        }
      ]
    }
  ]
}