{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "VAANI testing build redeploy & verification (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add repeatable redeploy workflow for the existing VAANI testing build (no new project) with a safe retry path on failure.",
      "acceptanceCriteria": [
        "A new deployment is completed for the existing VAANI project (not a new canister/app).",
        "If a deployment error occurs, the deployment is retried and completes successfully.",
        "The deployed app is reachable in a browser as a testing build."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/redeploy-testing-build.sh",
          "operation": "create",
          "description": "Create a redeploy helper script that runs the existing deploy command(s) for the current VAANI project and includes a simple retry-on-failure flow (re-run deploy after an error). Keep it non-destructive (no project initialization) and focused on redeploying the current draft."
        },
        {
          "path": "frontend/DEPLOYMENT_VERIFICATION.md",
          "operation": "modify",
          "description": "Fill in the currently-empty 'Rebuild & Redeploy Commands' section with the exact commands used to redeploy the existing VAANI project and how to retry safely if the previous attempt errors, without initializing a new project."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update verification checklist to match the current provider hierarchy and ensure the header logo asset is present to avoid console/provider errors and asset 404s in the live testing build.",
      "acceptanceCriteria": [
        "All checklist items in `frontend/DEPLOYMENT_VERIFICATION.md` can be confirmed in the live environment.",
        "No provider-related console errors occur (e.g., \"useAuth must be used within AuthProvider\" / \"useInternetIdentity must be used within InternetIdentityProvider\").",
        "No broken image/asset 404 errors occur for the header logo asset."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/vaani-logo-header.dim_240x64.svg",
          "operation": "create",
          "description": "Add the required generated header wordmark asset at the exact path `frontend/public/assets/generated/vaani-logo-header.dim_240x64.svg` so the live build does not 404 when loading the header logo."
        },
        {
          "path": "frontend/DEPLOYMENT_VERIFICATION.md",
          "operation": "modify",
          "description": "Align the 'Provider Hierarchy Verification' section with the actual app wrapper order (as implemented in `frontend/src/main.tsx` and `frontend/src/App.tsx`), and ensure the checklist explicitly validates that `frontend/public/assets/generated/vaani-logo-header.dim_240x64.svg` is served without 404 and that provider-related console errors do not occur."
        }
      ]
    }
  ]
}