{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix AuthProvider placement so useAuth never renders outside provider",
  "requirements": [
    {
      "id": "REQ-72",
      "summary": "Mount AuthProvider at the absolute top of the app tree so it always wraps TanStack RouterProvider and all routed content, eliminating useAuth crash during auth transitions.",
      "acceptanceCriteria": [
        "`frontend/src/main.tsx` no longer renders `<App />` directly; the routed application is rendered via TanStack Router’s `RouterProvider` using the existing `router`/`routeTree`.",
        "The mounted provider order ensures `AuthProvider` wraps `RouterProvider` (and thus all routed content) without any conditional rendering of provider presence.",
        "Reproducing the prior flow (initial load, then login, then logout) no longer produces the console error `useAuth must be used within AuthProvider`, and the UI does not blank/white-screen.",
        "`CreatorZoneTab` (and any other `useAuth()` consumer) is never rendered outside `AuthProvider` at any point during transitions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Replace direct `<App />` rendering with TanStack Router’s `RouterProvider` using the existing exported `router`, and move `AuthProvider` (from `frontend/src/contexts/AuthContext.tsx`) to unconditionally wrap `RouterProvider` at the top of the React tree (above all routes/components, including `CreatorZoneTab`). Keep existing providers (React Query, Internet Identity) mounted without condition. Use the selected `authorization` component patterns for auth lifecycle expectations; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Remove any duplicate/nested AuthProvider usage so exactly one AuthProvider instance wraps the entire routed tree.",
      "acceptanceCriteria": [
        "There is a single, top-level `AuthProvider` for the application; no nested/duplicate `AuthProvider` instances remain in route/layout/component trees.",
        "No component that calls `useAuth()` can be reached/rendered unless it is a descendant of the single top-level `AuthProvider`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routeTree.tsx",
          "operation": "modify",
          "description": "Audit the routed layout tree to ensure it does not mount or re-mount `AuthProvider` (or any wrapper that includes it) anywhere inside the router hierarchy; keep route paths and definitions unchanged (`/` and `/studio`). If any nested/duplicate provider is found during audit, remove it so only the `frontend/src/main.tsx` top-level `AuthProvider` remains. Use the selected `authorization` component guidance to ensure all `useAuth()` consumers are descendants; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the home route component tree (including `CreatorZoneTab`) to ensure it does not introduce its own `AuthProvider` wrapper and relies solely on the single top-level provider from `frontend/src/main.tsx`. Make any necessary adjustments to remove duplicate/nested providers (if present) without changing user-facing text or route behavior. Use the selected `authorization` component guidance; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-74",
      "summary": "Document redeploy + deployed-environment verification steps for the provider-order fix.",
      "acceptanceCriteria": [
        "A new deployed version is produced after the provider-order change.",
        "In the deployed version, the app no longer shows a blank screen and the console no longer logs `Uncaught Error: useAuth must be used within AuthProvider` originating from `CreatorZoneTab`."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_VERIFICATION.md",
          "operation": "create",
          "description": "Add a short redeploy-and-verify checklist specific to this fix: rebuild/redeploy steps for the frontend, and a deployed-environment verification script (load → login → logout) including what to check in the console (absence of `useAuth must be used within AuthProvider`) and that the UI does not white-screen. Keep all text in English."
        }
      ]
    }
  ]
}